package lissen_2;

import java.util.Scanner;

public class Lissen_2 {
    public static void main(String[] args) {
        /**
         *  Тема урока Операторы сравнения.
         *  Разбираемся на примере Калькулятора!!!
         */
//        Scanner scan = new Scanner(System.in);
//        String action;
//        System.out.println("Введите первое число: ");
//        double num1 = scan.nextDouble();
//        System.out.println("Введите второе число:");
//        double num2 = scan.nextDouble();
//        double answ = 0;
//        System.out.println("Введите действие которое хотите сделать!!!");
//        System.out.println("< + > сумма чисел");
//        System.out.println("< - > разница чисел");
//        System.out.println("< * > умножение чисел");
//        System.out.println("< / > деление чисел");
//
//        while (true) {
//            action = new Scanner(System.in).nextLine();
//            if (action.equals("+")) {
//                answ = num1 + num2;
//                break;
//            } else if (action.equals("-")) {
//                answ = num1 - num2;
//                break;
//            } else if (action.equals("*")) {
//                answ = num1 * num2;
//                break;
//            } else if (action.equals("/")) {
//                answ = num1 / num2;
//                break;
//            } else System.out.println("Неверный формат данных (действия)");
//        }
//
//
//
//        System.out.println("Ответ: " + answ);
//        System.out.printf("Ответ: %.2f", answ);

//        System.out.println("Ответ: " + (action.equals("+")? num1 + num2: action.equals("-")? num1 - num2:
//        action.equals("*")? num1 * num2: action.equals("/")? num1 / num2: "Неверный формат данных"));



        // ===================================================================
        // циклы

//        int count = 0;
//        while (count < 10){
//
//            System.out.println("цикл: " + count);
//
//            count = count + 1;
//        }
//        for(int i = 0; i < 10; i++){
//            System.out.println("Цикл for " + i);
//        }

//        do{
//            count ++;
//            System.out.println("Цикл doWile " + count);
//        }while (count < 10);

        // Домашнее задание
        /*
         1 Задача
         Вводится три числа
         а = ввести значение
         б = ввести значение
         с = ввести значение

         Являются ли введенные значение сторонами треугольника

        Написать программу которая выведет сообщение о том что стороны являются сторонами треуголка
        или это не треугольник

        защита от ошибки
        а = 90
        б = 90
        с = 0
        то это не треугольник


        2 задача
        Написать программу которая будет принимать год (1990) со стороны пользователя
        выводить сколько лет исполнилось пользователю
        формат ввода данных 1990 => 32 года \\ 25 лет \\ 21 год


        3 задача
        вывести таблицу умножения через цикл (вводных данных нет)
        0 => 10

        0 * 0 = 0              1 * 0 = 0          2 * 0 = 0
        0 * 1 = 0              1 * 1 = 1          2 * 1 = 2
        0 * 2 = 0              1 * 2 = 2          2 * 2 = 4
        0 * 3 = 0              1 * 3 = 3          2 * 3 = 6
        0 * 4 = 0              1 * 4 = 4          2 * 4 = 8
        0 * 5 = 0              1 * 5 = 5          2 * 5 = 10
        0 * 6 = 0              1 * 6 = 6          2 * 6 = 12
        0 * 7 = 0              1 * 7 = 7          2 * 7 = 14
        0 * 8 = 0              1 * 8 = 8          2 * 8 = 16
        0 * 9 = 0              1 * 9 = 9          2 * 9 = 18
        0 * 10 = 0             1 * 10 = 10        2 * 10 = 20


        4 задача  (Не обязательная)
        Подумать как улучшить калькулятор и что можно добавить в функционал
         */


    }
}
